Update architecture documentation
